import 'package:sushi_shop_project/full_menu_widget/tools/dish_model_for_search.dart';

class DishData {
  static List<DishSearchModel> mainDishList= [
    DishSearchModel("Борщ пісний з копченою грушею", 55.00, "assets/images/dish_of_day_1.png", "Подається зі сметаною."),

    DishSearchModel("Суп-локшина на наваристому курячому бульоні", 61.00, "assets/images/most_popular_1.png", "Подається з куркою, домашньою локшиною, та сухариками."),

    DishSearchModel("Ніжка кролика тушкована у вершковому соусі", 254.00, "assets/images/most_popular_2.png", "Подається з диким рисом."),

    DishSearchModel("Фірмове сало від 'Корчми' - сало домашнє", 49.00, "assets/images/most_popular_2.png",
        "'Фірмове сало від 'Корчми' - це ніжне домашнє сало, яке стало візитною карткою ресторану 'Корчма'. Воно приготовлено з найкращих шматочків свинини, вручну підготовлених та нарізаних експертами свого ремесла. Це сало відображає найкращі традиції гастрономічної майстерності і дух гостинності, який завжди присутній у ресторані 'Корчма'. Додайте аутентичний смак до свого столу з цим вишуканим домашнім салом, який надає вам можливість насолоджуватися смачними моментами в стилі 'Корчма' у затишному домашньому оточенні."),

    DishSearchModel("Каша рисова з малиновим варенням", 27.20, "assets/images/pasta_1.png",
        "'Каша рисова з малиновим варенням' - це чудова поєднання ніжності та аромату. Крихка каша зі свіжо вареним рисом робить ваш ранок ще більш смачним та затишним. Додайте до цього ніжне малинове варення, яке додає легкості та приємної сладкості. Це поєднання створює ідеальний баланс між смаками - рисова каша доповнюється ароматом свіжих малин, завдяки чому кожен ковток наповнений смаком і теплом. 'Каша рисова з малиновим варенням' - це не просто страва, а насправді особливий момент на вашому столі, який робить сніданок чудовим та незабутнім."),

    DishSearchModel("Фірмове сало від Корчми - з гірчицею копчене", 49.00, "assets/images/pasta_1.png",
      "'Фірмове сало від 'Корчми' з гірчицею копчене'- це справжня гастрономічна палітра смаків і ароматів. Ця страва представляє собою найкраще домашнє сало, виготовлене з найвідібраніших шматочків свинини та неперевершене поєднання копченої гірчиці. Копчене сало надає унікальний аромат та ніжний смак, підкреслюючи вишуканий смак свіжої гірчиці. Цей делікатес відображає золотий стандарт ресторану 'Корчма' і запрошує вас на незабутню гастрономічну подорож, де кожен шматочок є відомим і відчутним акордом на шляху до задоволення від їжі. 'Фірмове сало від 'Корчми' з гірчицею копчене' - це втілення смакового розкоші та гастрономічної різноманітності, яке залишить незабутні враження на вашому піднебінні.",),

    DishSearchModel("Оселедець домашнього посолу Тарас Бульба", 79.00, "assets/images/pasta_1.png",
      "'Оселедець домашнього посолу Тараса Бульби' - це насичений відтінками смаку та аромату делікатес, який переносить вас у вир цікавих та смачних традицій. Цей оселедець - продукт власного посолу Тараса Бульби, виготовлений з найсвіжіших оселедців та ніжно підготовлений з додаванням традиційних спецій та інгредієнтів. Завдяки майстерності і досвіду, оселедець набуває яскравого смаку та аромату, які виразно виражають домашність та автентичність. Цей делікатес стає не лише джерелом смакового задоволення, але й можливістю зануритися в кулінарні традиції і культуру української кухні через очі Тараса Бульби.",),

    DishSearchModel("Салат улюблений з дитинства Олів'є", 59.00, "assets/images/salad_1.png",
        "З куркою або з ковбасою. Заправляється домашнім майонезом."),

    DishSearchModel("Салат із запеченим гарбузом", 72.00, "assets/images/salad_1.png",
      "Руккола,коріандр, помідори чері з запеченим гарбузом, заправляється ягідним соусом.",),

    DishSearchModel("Салат Оселедець під шубою", 69.90, "assets/images/salad_1.png",
        "Традиційний салат з оселедця, з запеченими овочами та майонезом."),
  ];
}