import 'package:flutter/material.dart';
import 'package:sushi_shop_project/screens/full_menu/full_menu_components/pasta_card.dart';

class PastaMenu extends StatelessWidget {
  PastaMenu({Key? key}) : super(key: key);

  final List PastaCardList = [
    {
      "name": "Каша рисова з малиновим варенням",
      "price": 27.20,
      "image": "assets/images/pasta_1.png",
      "description": "'Каша рисова з малиновим варенням' - це чудова поєднання ніжності та аромату. Крихка каша зі свіжо вареним рисом робить ваш ранок ще більш смачним та затишним. Додайте до цього ніжне малинове варення, яке додає легкості та приємної сладкості. Це поєднання створює ідеальний баланс між смаками - рисова каша доповнюється ароматом свіжих малин, завдяки чому кожен ковток наповнений смаком і теплом. 'Каша рисова з малиновим варенням' - це не просто страва, а насправді особливий момент на вашому столі, який робить сніданок чудовим та незабутнім.",
    },
    {
      "name": "Фірмове сало від Корчми - з гірчицею копчене",
      "price": 49.00,
      "image": "assets/images/pasta_1.png",
      "description": "'Фірмове сало від 'Корчми' з гірчицею копчене'- це справжня гастрономічна палітра смаків і ароматів. Ця страва представляє собою найкраще домашнє сало, виготовлене з найвідібраніших шматочків свинини та неперевершене поєднання копченої гірчиці. Копчене сало надає унікальний аромат та ніжний смак, підкреслюючи вишуканий смак свіжої гірчиці. Цей делікатес відображає золотий стандарт ресторану 'Корчма' і запрошує вас на незабутню гастрономічну подорож, де кожен шматочок є відомим і відчутним акордом на шляху до задоволення від їжі. 'Фірмове сало від 'Корчми' з гірчицею копчене' - це втілення смакового розкоші та гастрономічної різноманітності, яке залишить незабутні враження на вашому піднебінні.",
    },
    {
      "name": "Оселедець домашнього посолу Тарас Бульба",
      "price": 79.00,
      "image": "assets/images/pasta_1.png",
      "description": "'Оселедець домашнього посолу Тараса Бульби' - це насичений відтінками смаку та аромату делікатес, який переносить вас у вир цікавих та смачних традицій. Цей оселедець - продукт власного посолу Тараса Бульби, виготовлений з найсвіжіших оселедців та ніжно підготовлений з додаванням традиційних спецій та інгредієнтів. Завдяки майстерності і досвіду, оселедець набуває яскравого смаку та аромату, які виразно виражають домашність та автентичність. Цей делікатес стає не лише джерелом смакового задоволення, але й можливістю зануритися в кулінарні традиції і культуру української кухні через очі Тараса Бульби.",
    },
  ];

  @override
  Widget build(BuildContext context) {
    return SizedBox(
      height: 220,
      child: ListView.builder(
        itemCount: PastaCardList.length,
        scrollDirection: Axis.horizontal,
        itemBuilder: (context, index) {
          var dish = PastaCardList[index];
          return PastaCard(
            nameDish: dish["name"],
            price: dish["price"],
            imagePastaCard: dish["image"],
            description: dish["description"],
          );
        },
      ),
    );
  }
}
